Repository: CZ-NIC/fred-client
Catalog: fred/lang/fred_client_*.po
Languages: cs

source: The EPP 'update_nsset' command is used to update values in the NSSET.
cs: EPP příkaz 'update_nsset' se používá pro aktualizaci hodnot záznamu vybraného NSSETu.

source: The EPP 'update_keyset' command is used to update values in the KEYSET.
cs: EPP příkaz 'update_keyset' se používá pro aktualizaci hodnot záznamu vybraného KEYSETu.

source: The EPP 'sendauthinfo_contact' command transmit request for send password to contact email. This command is usefull during transfer when owner and new registrar needn't require previous registrar for password.
cs: Příkaz 'sendauthinfo_contact' předá požadavek na odeslání autorizačního hesla na email kontaktu. Tento příkaz je užitečný při transferu kdy vlastník a nový registrátor nemusí žádat původního registrátora o zaslání hesla.

source: The EPP 'sendauthinfo_domain' command transmit request for send password to registrant email. This command is usefull during transfer when owner and new registrar needn't require previous registrar for password.
cs: Příkaz 'sendauthinfo_domain' předá požadavek na odeslání autorizačního hesla na email vlastníka domény. Tento příkaz je užitečný při transferu kdy vlastník a nový registrátor nemusí žádat původního registrátora o zaslání hesla.

source: The EPP 'sendauthinfo_nsset' command transmit request for send password to technical contact email. This command is usefull during transfer when owner and new registrar needn't require previous registrar for password.
cs: Příkaz 'sendauthinfo_contact' předá požadavek na odeslání autorizačního hesla na email technického kontaktu. Tento příkaz je užitečný při transferu kdy vlastník a nový registrátor nemusí žádat původního registrátora o zaslání hesla.

source: The EPP 'sendauthinfo_keyset' command transmit request for send password to technical contact email. This command is usefull during transfer when owner and new registrar needn't require previous registrar for password.
cs: Příkaz 'sendauthinfo_keyset' předá požadavek na odeslání autorizačního hesla na email technického kontaktu. Tento příkaz je užitečný při transferu kdy vlastník a nový registrátor nemusí žádat původního registrátora o zaslání hesla.

source: The EPP 'credit_info' command returns credit information.
cs: Příkaz 'credit_info' zobrazí informace o kreditu.

source: The EPP 'technical_test' command transmit request for technical test for particular NSSET and domain. The result of the test will be saved into the message queue from where the registrant can fetch it by poll command. Every test has report level (number) and run just a parts what have equal or lower level number. Valid range is from 0 to 10. Set report level in the command create_nsset and update_nsset.
cs: Příkaz 'technical_test' předá požadavek na provedení technického testu pro příslušný NSSET a doménu. Po skončení testu bude výsledek uložen do zpráv, které si registrátor vybírá příkazem poll. Každý test má svůj report level (číslo) a spouští jen ty čáti testu, které mají toto číslo shodé nebo nižší. Platný rozsah je 0 až 10. Nastavit report level je možné v příkazech create_nsset a update_nsset.

source: Prepare list of the contacts. This command fills server buffer by list of contacts and set pointer at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam kontaktů. Tento příkaz zaplní buffer na serveru seznamem kontaktů a nastaví ukazatel na začátek seznamu. Data se načítají postupně opakovaným voláním příkazu 'get_results' dokud se vracejí nějaká data.

source: Prepare list of the domains. This command fills server buffer by list of domains and set pointer at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam domén. Tento příkaz zaplní buffer na serveru seznamem domén a nastaví ukazatel na začátek seznamu. Data se načítají postupně opakovaným voláním příkazu 'get_results' dokud se vracejí nějaká data.

source: Prepare list of the NSSETs. This command fills server buffer by list of nssets and set pointer at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam NSSETů. Tento příkaz zaplní buffer na serveru seznamem nssetů a nastaví ukazatel na začátek seznamu. Data se načítají postupně opakovaným voláním příkazu 'get_results' dokud se vracejí nějaká data.

source: Prepare list of the KEYSETs. This command fills server buffer by list of keysets and set pointer at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam KEYSETů. Tento příkaz zaplní buffer na serveru seznamem keysetů a nastaví ukazatel na začátek seznamu. Data se načítají postupně opakovaným voláním příkazu 'get_results' dokud se vracejí nějaká data.

source: Returns a data chunk from the list of the records in the server buffer. Pointer is moved to next part after every transmition. If no data received the end of list has been reached. New list is created by function (contacts_by_all, nssets_by_all, domains_by_all, ...) or domains_by_contact, domains_by_nsset etc.
cs: Vrátí část seznamu z bufferu serveru. Po každém stažení se ukazatel na serveru posune na další část. Pokud se již žádná data nevracejí, tak bylo dosaženo konce seznamu. Nový seznam se nastavuje pomocí příkazů (contact_by_all, nsset_by_all, domain_by_all, ...) nebo domains_by_contact, domains_by_nsset atd.

source: Returns list of contacts using command contacts_by_all and runs a loop of get_results commands until whole list of contacts not received.
cs: Vrátí seznam kontaktů za použití příkazu contacts_by_all a opakovaného spouštění příkazu get_results, dokud se nenačte celý seznam.

source: Returns list of domains using command domains_by_all and runs a loop of get_results commands until whole list of domain names not received.
cs: Vrátí seznam domén za použití příkazu domains_by_all a opakovaného spouštění příkazu get_results, dokud se nenačte celý seznam.

source: Returns list of nssets using command nssets_by_all and runs a loop of get_results commands until whole list of nssets not received.
cs: Vrátí seznam nssetů za použití příkazu nssets_by_all a opakovaného spouštění příkazu get_results, dokud se nenačte celý seznam.

source: Returns list of keysets using command nssets_by_all and runs a loop of get_results commands until whole list of keysets not received.
cs: Vrátí seznam keysetů za použití příkazu keysets_by_all a opakovaného spouštění příkazu get_results, dokud se nenačte celý seznam.

source: Prepare domains by NSSET. This command fills server buffer by list of domains connected with defined nsset ID. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam NSSETů. Tento příkaz zaplní buffer na serveru seznamem domén, které mají přiřazen zadaný nsset ID. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Prepare domains by KEYSET. This command fills server buffer by list of domains connected with defined keyset ID. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam KEYSETů. Tento příkaz zaplní buffer na serveru seznamem domén, které mají přiřazen zadaný keyset ID. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Prepare domains by contact. This command fills server buffer by list of domains where occurs defined contact ID. It can be Registrant ID or Admin ID or Temporary ID. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam domén podle kontaktu. Tento příkaz zaplní buffer na serveru seznamem domén, ve kterých se vyskytuje zadané ID kontaktu. Může to být ID držitele nebo administrativní a dočasný kontakt. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Prepare NSSETs by contact. This command fills server buffer by list of nssets connected with defined technical contact ID. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam NSSETů podle kontaktu. Tento příkaz zaplní buffer na serveru seznamem nssetů, které mají přiřazen zadané ID technického kontaktu. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Prepare KEYSETs by contact. This command fills server buffer by list of keysets connected with defined technical contact ID. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam KEYSETů podle kontaktu. Tento příkaz zaplní buffer na serveru seznamem keysetů, které mají přiřazen zadané ID technického kontaktu. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Prepare NSSETs by NS. This command fills server buffer by list of nssets connected with defined name server. The pointer is set at the beginning of the list. The list is taken in sequence by calling command 'get_results' repeatedly until any data comming.
cs: Připravit seznam NSSETů podle NS. Tento příkaz zaplní buffer na serveru seznamem nssetů, které mají přiřazen zadaný jmenný server. Ukazatel pro čtení je nastaven na začátek seznamu. Části seznamu se načítají opakovaným voláním příkazu 'get_results'. Pokud již get_results žádné údaje nevrací, tak bylo dosaženo konce seznamu.

source: Client transaction ID
cs: ID klient transakce

source: Repository object ID
cs: ID objektu v rep.

source: Created by
cs: Vytvořil

source: Designated registrar
cs: Určený registrátor

source: Updated by
cs: Změnil

source: Created on
cs: Vytvořeno dne

source: Last transfer on
cs: Poslední transfer dne

source: Last update on
cs: Poslední změna dne

source: Password for transfer
cs: Heslo pro transfer

source: Status
cs: Stav

source: Status message
cs: Popis stavu

source: Hide
cs: Skrýt

source: Include into ENUM dict
cs: Přidat do ENUM tel.sezn.

source: Administrative contact
cs: Administrativní kontakt

source: Temporary contact
cs: Dočasný kontakt

source: Last updated on
cs: Poslední změna dne

source: Name servers
cs: Jmenné servery

source: Report level
cs: Stupeň detailů

source: DS records
cs: DS záznamy

source: DNSKEY records
cs: DNSKEY záznamy

source: Available languages
cs: Podporované jazyky

source: Server ID
cs: ID serveru

source: Server date
cs: Datum serveru

source: Available protocols
cs: Podporované protokoly

source: Objects URI
cs: URI objekt

source: Extensions URI
cs: URI rozšíření

source: List
cs: Seznam

source: Count
cs: Počet

source: Queue size
cs: Počet zpráv

source: Message ID
cs: ID zprávy

source: Message date
cs: Zpráva vložena

source: Message type
cs: Typ zprávy

source: Message content
cs: Text zprávy

source: Number of records
cs: Počet záznamů

source: Notify
cs: Oznámení

source: Invalid XML document. ExpatError: %s
cs: Neplatný XML dokument. ExpatError: %s

source: Document has wrong encoding. LookupError: %s
cs: Dokument má chybné kódování. LookupError: %s

source: Internal error: Master node '%s' doesn't exist.
cs: Interní chyba: Nadřazený uzel '%s' neexistuje.

source: Internal error: Value is not dict type:
cs: Interní chyba: Hodnota není typu dict:

source: This program requires Python 2.4 or higher. Your version is
cs: Tento program vyžaduje Python 2.4 nebo vyšší. Vaše verze je

source: Login failed
cs: Login se nezdařil

source: Invalid EPP XML document. Last tag missing.
cs: Neplatný EPP XML dokument. Chybí poslední tag.

source: Send files
cs: Odeslat soubory

source: sending...
cs: posílám...

source: Module for sending files to the EPP server.
cs: Modul pro odeslání souborů na EPP server.

source: -o OUTPUT_TYPE, --output=OUTPUT_TYPE Display output as text (default), html, xml, php (Beware! For experimental only!)
cs: -o OUTPUT_TYPE, --output=OUTPUT_TYPE Zobrazit výstup jako text (default), html, xml, php (Pozor! Jen pro testování!)

source: Unknown output type. Valid types are
cs: Neznámý typ výstupu. Platné typy jsou

source: Command confirmation has been set to
cs: Potvrzení přikazu bylo nastaveno na

source: Invalid Command confirmation parametr
cs: Neplatný parametr příkazu Confirmation

source: Type 'help confirm' to get more information about confirm commands.
cs: Zadejte 'help confirm' pro zobrazení detailů příkazu.

source: Type "help", "license" or "credits" for more information.
cs: Zadejte "help", "license" or "credits" pro zobrazení více informací.

source: Invalid format of
cs: Neplatný formát

source: See help for more.
cs: Více informací najdete v helpu.

source: cannot be empty
cs: nemůže být prázdné

source: Actual config builded from files
cs: Aktuální config sestavený ze souborů

source: No configuration file. Defaults used instead it.
cs: Konfigurační soubor nebyl zadán. Byly použity defaultní hodnoty.

source: No config
cs: Žádný config

source: Actual connection HERE
cs: Aktuální spojení ZDE

source: Schema in session missing. This is invalid instalation.
cs: Chybí schema v session. Tato instalace je neplatná.

source: Invalid version name %s. It must be one from (%s).
cs: Neplatné jméno verze %s. Musí být ze seznamu (%s).

source: Invalid version format
cs: Neplatný formát verze

source: Using configuration from
cs: Použit konfigurační soubor

source: Fatal error: Default config create failed.
cs: Fatální chyba: Vytvoření defaultního konfiguračního souboru selhalo.

source: Session "%s" without effect. No configuration file.
cs: Session "%s" nemá význam. Není načten žádný konfigurační soubor.

source: Configuration file has no section "%s".
cs: Konfigurační soubor nemá sekci "%s".

source: Invalid verbose parametr
cs: Neplatný parametr verbose

source: Type 'help verbose' to get more information about verbose levels.
cs: Zadejte 'help verbose' pro zobrazení detailů příkazu.

source: Verbose level is out of range. Available values are 1, 2, 3.
cs: Hodnota módu výstupu je mimo stanovený rozsah. Dostupné hodnoty jsou 1, 2, 3.

source: External validator "%s" not found. XML validation has been disabled.
cs: Externí validátor "%s" nebyl nalezen. XML validace byla vypnuta.

source: XML document is empty.
cs: XML dokument je prázdný

source: Client-side validation command:
cs: Příkaz pro validátor:

source: Reading xmllint errors result failed.
cs: Čtení zprávy o chybách z xmllintu selhalo.

source: Warning: Client-side validation failed.
cs: Pozor: Validace na straně klienta selhala.

source: Client-side validation has been disabled. Type '%s' to enable it.
cs: Validátor byl deaktivován. Opětná aktivace se provede zadáním %s.

source: Different %s schema version.
cs: Odlišná verze %s schemat.

source: Client schema version is%s %s%sand on the server is%s %s
cs: Lokální verze schema je %s %s%skdežto na serveru je%s %s

source: command
cs: příkaz

source: Start interactive input mode on this command
cs: Spustit interaktivní režim zadávání na tomto příkazu

source: ! starts interactive input mode. In interactive input mode the program asks to fill in all command parameters one by one to help users construct proper syntax. After going through all parameters actual command syntax is displayed before issuing command to server. Interactive mode can be used with EPP commands only.
cs: ! spustí interaktivní mód vkládání parametrů. Program v interaktivním módu vybízí k zadání všech parametrů jeden za druhým a tím pomáhá uživateli sestavit příkazy s obtížnější syntaxí. Po zadání všech potřebných hodnot je výsledný příkaz zobrazen před tím, než je odeslán na server Interaktivní mód lze použít pouze na EPP příkazy.

source: switch
cs: přepínač

source: Turn function on/off.
cs: Zapnout/vypnout funkci on/off.

source: Turn on/off colored output.
cs: Zapnout/vypnout barevný výstup.

source: Set escaped input on/off.
cs: Zapnout/vypnout přepínač escapovaného vstupu.

source: If your input is escaped (&lt;example&amp;test&gt;), set this value on.
cs: Je-li váš vstup escapovaný (&lt;example&amp;test&gt;), nastavte tuto hodnotu na on.

source: Display actual configuration.
cs: Zobrazí aktuální konfiguraci.

source: Set on/off command confirmation for sending editable commands to the server.
cs: Zapnout/vypnout potvrzování odesílání editačních příkazů na server.

source: Display credits.
cs: Zobrazit credits.

source: Get detailed help for this command.
cs: Zobrazit detailní nápovědu pro tento příkaz.

source: Help displays all available commands (type 'help') or displays detailed help for selected command (type 'help command'). Help uses synonyms 'help', '?' or 'h'.
cs: Nápověda zobrazí všechny dostupné příkazy (zadejte 'help') nebo zobrazí detaily vybraného příkazu (zadejte 'help příkaz'). Nápověda používá synonyma 'help', '?' nebo 'h'.

source: code
cs: kód

source: Set user interface language.
cs: Nastavení jazykové verze.

source: Set the client language and server together. If you are online and want to change the server language too, you have to logout and login again. Language is also possible to change by 'login' command or specify in configuration file or set in options on the command line.
cs: Nastavit jazykovou verzi pro klienta a server. Pokud jste online a chcete změnit jazyk odpovědí serveru, musíte se znova zalogovat. Jazyk je také možné nastavit příkazem 'login', definováním v konfiguračním souboru nebo zadáním parametru v příkazové řádce.

source: Displays license terms of this application.
cs: Zobrazí licenční ujednání této aplikace.

source: Set representation of the value what is used to mean nothing. Default is NULL. This value we use if we want to skip over any column in the command parameters. Type NULL means we did not put any value in contrast to '' or "" where we put value of zero length. Synonym of the 'null_value' is 'null'. See help for more details.
cs: Nastavení zástupce pro hodnotu nic (Nil), která vyjadřuje žádnou hodnotu. Default je NULL. Tuto hodnotu používáme, když chceme přeskočit některý z parametrů příkazu. Zadání NULL znamená, že jsme nezadali žádnou hodnotu na rozdíl od '' nebo "", kdy jsme zadali hodnotu nulové délky. Synonymum pro 'null_value' je 'null'. Více informací naleznete v helpu.

source: type
cs: typ

source: Set the output type.
cs: Nastavit formát výstupu.

source: Display output in type.
cs: Zobrazit výstup ve formátu.

source: First see 'help poll' for understanding how to manage the server messages. Funcion poll_autoack causes the client will send two poll commands instead of the one only. First poll is sent as 'poll req' and second as 'poll ack'. The result is a message what has been removed from the message queue.
cs: V 'help poll' je popsán způsob jak se odebírají zprávy ze serveru. Příkaz poll se musí zadat dvakrát. Funkce poll_autoack umožňuje odeslání poll sloučit do jednoho příkazu tak, že po odeslání poll req klient automaticky odešle i poll ack. To umožňuje vybírání zpráv jen na jeden příkaz poll.

source: Disconnects from the server and exits the application. Synonyms 'q' and 'exit' can be used to invoke same functionality.
cs: Odpojí se od serveru a ukončí aplikaci. Synonyma 'q' a 'exit' mají stejnou funkci.

source: mode
cs: mód

source: Define display mode. XML (default) or DICT (dict or d).
cs: Nastavení módu zobrazení. XML (default) nebo slovník (dict or d).

source: Display XML source of the EPP answer. If you would display source without XML tag, type parametr 'dict' or simple 'd'. Synonyms of 'raw-answer' are 'raw-a', 'src-answer' and 'src-a'.
cs: Zobrazit XML zdroj EPP odpovědi. Pokud chcete zdroj zobrazit bez XML tagů, zadejte parametr 'dict' nebo jednoduše 'd'. Synonyma pro 'raw-answer' jsou 'raw-a', 'src-answer' a 'src-a'.

source: Display XML source of the EPP command. If you would display source without XML tag, type parametr 'dict' or simple 'd'. Synonyms of 'raw-command' are 'raw-c', 'src-command' and 'src-c'.
cs: Zobrazit XML zdroj EPP příkazu. Pokud chcete zdroj zobrazit bez XML tagů, zadejte parametr 'dict' nebo jednoduše 'd'. Synonyma pro 'raw-command' jsou 'raw-c', 'src-command' a 'src-c'.

source: filename
cs: název souboru

source: any filename
cs: nějaký název souboru

source: Send any file to the server. If filename missing command shows actual folder.
cs: Odeslat soubor na server. Pokud jméno souboru není zadáno zobrazí se aktuální adresář.

source: Turn validation on/off.
cs: Zapnout/vypnout validaci on/off.

source: Client doesn't check command parameters itself. It uses for that external application 'xmllint' whats checks all parameters against to schema defined in XML specification. Switch turns validations ON or OFF. Default is ON. If xmllint is not present validation is turned off automaticly.
cs: Klient sám nekontroluje formát parametrů příkazů. K tomu používá externí program 'xmllint', který parametry ověřuje proti schematům definovaným v XML specifikaci. Přepínač switch validaci zapíná nebo vypíná on/off. Default je ON. Pokud xmllint není dostupný, tak se validace automaticky vypne.

source: level
cs: úroveň

source: Set verbose level. Available levels are 1, 2, 3.
cs: Nastavení úrovně výpisu. Dostupné úrovně jsou 1, 2, 3.

source: Client displays various informations. They are disparted to verbose levels. First verbose level (default) is designed to common user and give the output at the minimum has needed to work with. For inquiring users is aimed second level where are output all occured messages. The third level displays XML sources ad advance, transmited between client and server. Verbose modes: 1 - brief (default) 2 - full 3 - full & XML sources
cs: Klient zobrazuje různé informace. Ty jsou rozděleny do úrovní výpisu detailů. První úroveň (základní) je určena pro běžného uživatele a vypisuje minimum informací,které jsou potřeba k práci s klientem. Pro zvídavé uživatele je určena úroveň dvě, která vypisuje všechna hlášení, která se během práce s klientem objeví. Třetí úroveň navíc vypisuje XML zdrojové dokumenty, které si klient se serverem předává. Úrovně výpisu: 1 - stručný (základní) 2 - plný 3 - plný a XML zdroje

source: Command type.
cs: Typ příkazu.

source: Display on the output (no on the prompt).
cs: Zobrazit na výstupu (ne v příkazové řádce).
