Repository: CZ-NIC/fred-client
Catalog: fred/lang/fred_client_*.po
Languages: cs

source: This version of Python doesn't support SSL. Reinstall it with SLL support.
cs: Tato verze Pythonu nepodporuje SSL. Reinstalujte jej se SSL podporou.

source: Certificate names not set.
cs: Jména certifikátů nejsou zadána.

source: Private key file not found.
cs: Privátní klíč nebyl nalezen

source: Certificate key file not found.
cs: Soubor s certifikátem nebyl nalezen

source: Invalid port value
cs: Neplatné číslo portu

source: Socket type IPv6 (AF_INET6) is not present in socket module.
cs: Soket typu IPv6 (AF_INET6) není v modulu socket dostupný.

source: Used socket type
cs: Použitý typ soketu

source: Connecting to
cs: Připojuji se k

source: I cannot connect to the server
cs: Nemohu se připojit k serveru.

source: Interrupted by user
cs: Přerušeno uživatelem

source: Connection established.
cs: Spojení bylo navázáno.

source: Try to open SSL layer...
cs: Otevírám SSL vrstvu...

source: Certificates missing. Trying to connect without SSL!
cs: Certifikát chybí. Zkouším spojení bez SSL!

source: Certificate not signed by verified certificate authority.
cs: Použitý certifikát není podepsán uznávanou certifikační autoritou.

source: Server configuration is not valid. Contact administrator.
cs: Server není správně nakonfigurován. Obraťte se na správce serveru.

source: If this client runs under MS Windows and timeout is not zero, it is probably SLL bug! Set timeout back to zero.
cs: Jestliže tento klient běží v MS Windows a timeout není nula, tak se pravděpodobně jedná o SSL bug! Nastavte timeout zpět na nulu.

source: SSL layer opened.
cs: SLL vrstva byla aktivována.

source: Server returned an empty message.
cs: Server nevrátil žádnou odpověď.

source: Invalid parameter index
cs: Neplatný index parametru

source: Unknown parameter name
cs: Neznámé jméno parametru

source: Misplaced list or key
cs: Chybně umístěný seznam nebo klíč

source: Invalid bracket definition (Missing close).
cs: Nesprávné použití závorek (Chybí uzavření).

source: Invalid bracket. Only value or simple list allowed in key definition.
cs: Neplatná závorka. V zadání hodnoty klíčem je povolena jen jedna hodnota nebo prostý seznam.

source: Invalid bracket definition (list).
cs: Nesprávné použití závorek (list).

source: Invalid bracket definition (childs).
cs: Nesprávné použití závorek (childs).

source: Invalid bracket definition (missing close).
cs: Nesprávné použití závorek (chybí uzavření).

source: General options: -?, --help Show this help and exit -V, --version Display program version information and exit -l LANGUAGE, --lang=LANGUAGE Set user interface language -v LEVEL, --verbose=LEVEL Set verbose level 0 - print only XML answer from EPP server 1 - normal operation 2 - print more details 3 - print more details and display XML sources -x, --no_validate Disable client-side XML validation Connection options: -f CONFIG, --config=CONFIG Load configuration from config file -s SESSION, --session=SESSION Use session from config file -h HOSTNAME, --host=HOSTNAME Fred server host -p PORT, --port=PORT Server port (default: 700) -u USERNAME, --user=USERNAME Authenticate to server as user -w PASSWORD, --password=PASSWORD Authenticate to server with password -c CERTIFICATE --cert=CERTIFICATE Use SSL certificate to connect to server -k PRIVATEKEY --privkey=PRIVATEKEY Use SSL private key to connect to server -n, --nologin Disable automatic connection to server at start
cs: Hlavní parametry: -?, --help Zobrazit tuto nápovědu a skončit -V, --version Zobrazit verzi programu a skončit -l LANGUAGE, --lang=LANGUAGE Nastavení jazykové verze -v LEVEL, --verbose=LEVEL Nastavení módu výpisu 0 - zobrazit jen XML odpověď od EPP serveru 1 - normální výstup 2 - zobrazit více detailů 3 - zobrazit více detailů a XML zdroje -x, --no_validate Deaktivovat XML validaci na straně klienta Parametry pro spojení: -f CONFIG, --config=CONFIG Načtení konfigurace ze souboru -s SESSION, --session=SESSION Použít session z konfiguračního souboru -h HOSTNAME, --host=HOSTNAME Fred server host -p PORT, --port=PORT Server port (default: 700) -u USERNAME, --user=USERNAME Přihlásit se jako uživatel -w PASSWORD, --password=PASSWORD Přihlásit se s heslem -c CERTIFICATE --cert=CERTIFICATE Pro spojení použít SSL certifikát -k PRIVATEKEY --privkey=PRIVATEKEY Pro spojení použít SSL privátní klíč -n, --nologin Deaktivovat automatické spojení se serverem po startu

source: More details in verbose 2 or higher.
cs: Více detailů je ve verbose 2 nebo vyšším.

source: Command data XML document failed to validate.
cs: XML dokument příkazu se nepodařilo zvalidovat.

source: You are not connected.
cs: Nejste připojeni.

source: Do you really want to send this command to the server?
cs: Opravdu chcete odeslat tento poříkaz na server?

source: skipped
cs: zrušeno

source: Try to automaticly reconnect - send login.
cs: Zkouším automatické obnovení spojení - posílám login.

source: Server answer XML document failed to validate.
cs: Odpověď serveru v XML dokumentu se nepodařilo zvalidovat.

source: Usage: %s [OPTIONS...] Try '%s --help' for more information.
cs: Použití: %s [parametry...] Více informací získáze zadáním '%s --help'.

source: Usage
cs: Použití

source: See README for more information.
cs: Více informací najdete v README.

source: Unknown command
cs: Neznámý příkaz

source: ERROR
cs: CHYBA

source: Create EPP XML document from command line parameters.
cs: Vytvoří EPP XML dokument ze zadaných parametrů.

source: EXAMPLES
cs: PŘÍKLADY

source: optional
cs: nepovinný

source: required
cs: povinný

source: required only if part is set
cs: povinný jen je-li tato část zadána

source: minimum %d item
cs: minimum je %d položka

source: unbounded list
cs: libovolně velký seznam

source: list with max %d item.
cs: seznam o maximálně %d položce.

source: other_options
cs: další_parametry

source: Unknown EPP command. Select one from EPP commands list (Type help).
cs: Neznámý EPP příkaz. Vyberte jeden ze seznamu EPP příkazů (zadejte help).

source: Try
cs: Zkuste

source: Invalid parameter value.
cs: Neplatná hodnota parametru.

source: Invalid parameter
cs: Neplatný parametr

source: Corrupted value
cs: Neplatná hodnota

source: Correct format is
cs: Správný formát je

source: For example
cs: Například

source: poll req doesn't have msg_id value
cs: poll req hodnotu msg_id nemá

source: Command does not have any parameters.
cs: Příkaz nemá žádné parametry.

source: list of values overflow. Maximum is
cs: Počet položek v seznamu je překročen. Maximum je

source: Value "%s" is not allowed. Valid is
cs: Hodnota "%s" není povolena. Platná je

source: missing
cs: chybí

source: Can't finish input, required values must be set. Press Ctrl+C to abort.
cs: Nemohu dokončit zadání. Požadované hodnoty musí být zadány. Zadání zrušíte stisknutím Ctrl+C.

source: Interactive input aborted.
cs: Interaktivní mód byl zrušen.

source: Value is required. It MUST be set.
cs: Údaj je povinný. MUSÍ být zadán.

source: Parameter MUST be a value from following list
cs: Parametr MUSÍ být hodnota z následujícího seznamu

source: Example
cs: Příklad

source: For more type
cs: Pro více informací zadejte

source: Command %s does not have any parameters, skipping interactive input mode.
cs: Příkaz %s nemá žádné parametry, interaktivní mód byl zrušen.

source: Command %s does not have any parameters.
cs: Příkaz %s nemá žádné parametry.

source: Does not have any parameters, skipping interactive input mode.
cs: Žádné parametery nejsou třeba. Interaktivní mód ukončen.

source: Interactive input mode started. Press Ctrl+C to abort or Ctrl+D to finish command.
cs: Start interaktivního módu. Mód zrušíte stisknutím Ctrl+C. Příkaz dokončíte kombinací Ctrl+D.

source: Interactive input completed. [Press Enter]
cs: Interaktivní mód ukončen. [stiskněte Enter]

source: Command has been aborted.
cs: Příkaz byl zrušen.

source: Parameter val_ex_date is required dor ENUM domain.
cs: Parameter val_ex_date je pro ENUM domény povinný.

source: Missing required value.
cs: Chybí povinná hodnota

source: Limit of list is exceeded. The maximum is %d.
cs: Počet položek v seznamu byl překročen. Maximum je %d.

source: Value can be a list of max %d value.
cs: Hodnota může být seznam o max. velikosti %d položky.

source: Value can be an unbouded list of values.
cs: Hodnota může být libovolně velký seznam.

source: Minimum is
cs: Minimum je

source: Number identity card
cs: Číslo občanského průkazu

source: Number of passport
cs: Číslo pasu

source: Number of Ministry of Labour and social affairs
cs: Číslo Ministerstva práce a sociálních věcí

source: Number of company
cs: Číslo organizace

source: Birthday date
cs: Datum narození

source: Names what are not included into disclose list are set to opposite value of the disclose flag value.
cs: Jména která nejsou uvedena v seznamu disclose, jsou nastavena na opačnou hodnotu než má disclose flag.

source: Identificator type can be:
cs: Typ identifikátoru může být:

source: Command 'hello' is used to obtain information from the server. The server answer to 'hello' command is Greeting message. This message is used usualy at the begining of the session for getting some variables usefull for communication. Within Server version or ID you can got available languages, Data Collection policy etc. Command 'hello' you can call at any time.
cs: Příkaz 'hello' se používá pro získání informací od serveru. Server odpovídá na hello zprávou Greeting message. Tato zpráva se obvykle používá na počátku sezení, kdy se z ní získávají různé hodnoty užitečné při komunikaci. Kromě verze serveru a ID mužete získat seznam dostupných jazykových verzí, Data Collection policy atd. Příkaz 'hello' můžete volat kdykoliv.

source: The EPP "logout" command is used to end a session with the server. But client will be still running. For close client type 'quit' (see help). Before quit the client send logout automaticly.
cs: Příkaz 'logout' se používá pro ukončení spojení se serverem. Ale klient se tím neukončí. Klient se ukončí příkazem 'quit' (více v helpu). Před ukončením pošle klient logout automaticky.

source: Username
cs: Uživatelské jméno

source: Password
cs: Heslo

source: New password
cs: Nové heslo

source: Language version
cs: Jazyková verze

source: The "login" command establishes an ongoing server session that preserves client identity and authorization information during the duration of the session. Parametr "lang" set session and client language together. Language is possible to set also by option on the command line, or define it in configuration file or set by client command 'lang'. Using parameter 'new_password' you can change password.
cs: EPP příkaz "login" identifikuje uživatele a zahájí spojení s EPP serverem.Parametr "lang" nastaví jazykovou verzi pro klienta i odpovědi ze serveru.Jazyk je také možné definovat v konfiguračním souboru nebo zadat na příkazové řádce.Heslo můžete změnit zadáním parametru 'new_password'.

source: Contact ID
cs: Kontakt ID

source: The EPP 'info_contact' command is used to retrieve information associated with an existing contact. The value 'Password for transfer' is shown only for privileged user.
cs: EPP příkaz 'info_contact' se používá ke zjištění informací spojených s vybraným kontaktem. Hodnota 'Heslo pro transfer' je zobrazena jen oprávněnému uživateli.

source: Domain name
cs: Název domény

source: The EPP 'info_domain' command is used to retrieve information associated with an existing domain. The value 'Password for transfer' is shown only for privileged user. In addition for domain ENUM type the private values are also 'Registrant ID' and 'Administrative contact'.
cs: EPP příkaz 'info_domain' se používá ke zjištění informací spojených s vybranou doménou. Hodnota 'Heslo pro transfer' je zobrazena jen oprávněnému uživateli. Navíc pro domény typu ENUM jsou privátní i hodnoty 'ID držitele' a 'Administrativní kontakt'.

source: The EPP 'info_nsset' command is used to retrieve information associated with an existing NSSET. The value 'Password for transfer' is shown only for privileged user.
cs: EPP příkaz 'info_nsset' se používá ke zjištění informací spojených s vybraným NSSETem. Hodnota 'Heslo pro transfer' je zobrazena jen oprávněnému uživateli.

source: The EPP 'info_keyset' command is used to retrieve information associated with an existing KEYSET. The value 'Password for transfer' is shown only for privileged user.
cs: EPP příkaz 'info_keyset' se používá ke zjištění informací spojených s vybraným KEYSETem. Hodnota 'Heslo pro transfer' je zobrazena jen oprávněnému uživateli.

source: The EPP 'check_contact' command is used to determine if an contact can be provisioned within a repository. It provides a hint that allows a client to anticipate the success or failure of provisioning an contact using the 'create_contact' command as contact provisioning requirements are ultimately a matter of server policy.
cs: EPP Příkaz 'check_contact' se používá ke zjištění jestli se daný kontakt v repozitáři nachází. To umožňuje řídit spouštění příkazu 'create_contact' a poté vyhodnotit jestli příkaz uspěl nebo ne.

source: The EPP 'check_domain' command is used to determine if an domain can be provisioned within a repository. It provides a hint that allows a client to anticipate the success or failure of provisioning an domain using the 'create_domain' command as domain provisioning requirements are ultimately a matter of server policy.
cs: EPP Příkaz 'check_domain' se používá ke zjištění jestli se daná doména v repozitáři nachází. To umožňuje řídit spouštění příkazu 'create_domain' a poté vyhodnotit jestli příkaz uspěl nebo ne.

source: The EPP 'check_nsset' command is used to determine if an NSSET can be provisioned within a repository. It provides a hint that allows a client to anticipate the success or failure of provisioning an nsset using the 'create_nsset' command as NSSET provisioning requirements are ultimately a matter of server policy.
cs: EPP Příkaz 'check_nsset' se používá ke zjištění jestli se daný NSSET v repozitáři nachází. To umožňuje řídit spouštění příkazu 'create_nsset' a poté vyhodnotit jestli příkaz uspěl nebo ne.

source: The EPP 'check_keyset' command is used to determine if an KEYSET can be provisioned within a repository. It provides a hint that allows a client to anticipate the success or failure of provisioning an nsset using the 'create_nsset' command as KEYSET provisioning requirements are ultimately a matter of server policy.
cs: EPP Příkaz 'check_keyset' se používá ke zjištění jestli se daný KEYSET v repozitáři nachází. To umožňuje řídit spouštění příkazu 'create_keyset' a poté vyhodnotit jestli příkaz uspěl nebo ne.

source: Query type
cs: Typ požadavku

source: Index of message (required only with op = 'ack')
cs: Index zprávy (povinné jen při op = 'ack')

source: Poll command is used to discover and retrieve service messages. They are saved in the message queue. When you send poll with parameter op = req, you get only the last message from the queue. But this message still remains on the queue. For remove message from the queue set poll op = ack and ID of this message. So you needs to send two poll commands for manage one message: 1. reading, 2. removing. See help poll_autoack for client function that sends this commands together.
cs: Příkaz poll se používá k zobrazení servisních zpráv, které jsou na serveru. Pokus se poll pošle s parameterm op = req, tak server vrátí zprávu, která je poslední ve frontě zpráv. Zpráva ale zůstává ve frontě. Z fronty se zpráva odebere zadáním parametru op = ack a ID zprávy. Pro odebrání je tedy potřeba odeslat poll dvakrát: 1. čtení zprávy, 2. odebrání. V helpu příkazu poll_autoack je popsán způsob, jak tyto dva kroky sloučit v jeden.

source: Password required by server to authorize the transfer
cs: Heslo požadované serverem pro autorizaci transferu

source: The EPP 'transfer_contact' command makes change in contact sponsorship of a designated registrar. New password for authorisation will be generated automaticly after succefull transfer.
cs: EPP příkaz 'transfer_contact' mění editora existujícího kontaktu. Pokud transfer proběhne úspěšně, vygeneruje se automaticky nové autorizační heslo pro transfer.

source: The EPP 'transfer_nsset' command makes change in NSSET sponsorship of a designated registrar. New password for authorisation will be generated automaticly after succefull transfer.
cs: EPP příkaz 'transfer_nsset' mění editora existujícího NSSETu. Pokud transfer proběhne úspěšně, vygeneruje se automaticky nové autorizační heslo pro transfer.

source: The EPP 'transfer_keyset' command makes change in KEYSET sponsorship of a designated registrar. New password for authorisation will be generated automaticly after succefull transfer.
cs: EPP příkaz 'transfer_keyset' mění editora existujícího KEYSETu. Pokud transfer proběhne úspěšně, vygeneruje se automaticky nové autorizační heslo pro transfer.

source: Domain name of domain to change sponsorship
cs: Doménové jméno u kterého se změní editor

source: The EPP 'transfer_domain' command makes change in domain sponsorship of a designated registrar. New password for authorisation will be generated automaticly after succefull transfer.
cs: EPP příkaz 'transfer_domain' mění editora existující domény. Pokud transfer proběhne úspěšně, vygeneruje se automaticky nové autorizační heslo pro transfer.

source: Name
cs: Jméno

source: Street
cs: Ulice

source: City
cs: Město

source: Postal code
cs: PSČ

source: postal code
cs: PSČ

source: Country code
cs: Kód země

source: country code
cs: kód země

source: State or province
cs: Stát nebo kraj

source: Organisation
cs: Název organizace

source: password
cs: heslo

source: Phone
cs: Telefon

source: Disclose
cs: Zveřejnit

source: Disclose flag (default y)
cs: Přepínač zveřejnit (default y)

source: Data for with is set the flag value
cs: Data, pro které se nastaví příznak

source: VAT (Value-added tax)
cs: VAT (daňový identifikátor)

source: Identificator
cs: Identifikátor

source: Identificator number
cs: Čislo identifikátoru

source: Identificator type
cs: Typ identifikátoru

source: Notification email
cs: Oznámení na email

source: The EPP 'create_contact' command is used to create an instance of the contact. Contact can be used for values of the owner, registrant or technical contact.
cs: EPP příkaz 'create_contact' se používá pro vytvoření instance kontaktu. Kontakt může být použit pro údaje vlastníka, registrátora nebo technického kontaktu.

source: Registrant ID
cs: ID držitele

source: Period
cs: Období

source: Number of months or years
cs: Počet měsíců nebo roků

source: Period unit (y year(default), m month)
cs: Jednotka období (y rok(default), m měsíc)

source: Administrative contact ID
cs: Administrativní kontakt ID

source: Validation expires at date. This value is required for ENUM domains.
cs: Validace platná do data. Tato hodnota je pro ENUM domény povinná.

source: Include ENUM domain into ENUM dictionary
cs: Přidat ENUM doménu do ENUM telefonního seznamu

source: The EPP 'create_domain' command is used to create domain. A domain can be created for an indefinite period of time, or a domain can be created for a specific validity period. Basicly you can create two types of the domain: cz and ENUM. The difference is in parameter val_ex_date. It is required for ENUM domains.
cs: EPP příkaz 'create_domain' se používá pro vytvoření instance domény. Objekt může být vytvořen na neučitý časový úsek nebo na přesně definované období. Lze vytvořit domény dvou typů: cz a ENUM. Rozdíl je v parametru val_ex_date. Ten je pro ENUM domény povinný.

source: LIST of DNS
cs: Seznam DNS

source: Name server
cs: Jmenný server

source: Server address
cs: Adresa serveru

source: Technical contact
cs: Technický kontakt

source: Report range level (0 - 10; higher = more detailed)
cs: Rozsah testů (0 - 10; vyšší = detailnější)

source: The EPP 'create_nsset' command is used to create a record of the NSSET. Report level sets depth level of the technical test. These tests are maintained in regular intervals and in case of the problem the technical contact is informed. Report level is also applied on the test executed by the request throught EPP. Every test has report level (number) and run just a parts what have equal or lower level number. Valid range is from 0 to 10.
cs: EPP příkaz 'create_nsset' se používá pro vytvoření instance nssetu. Reportlevel nastavuje úroveň prováděných technických testů na nssetu. Tyto testy jsou prováděny v pravidelných intervalech a technický kontakt nssetu je informován o jejich výsledcích v případě neúspěchu. Reportlevel se vztahuje i na testy prováděné na vyžádání přes EPP. Každý prováděný test má přidělenou úroveň (číslo) a provádějí se jen ty části, které mají úroveň stejnou nebo nižší než reportlevel. Číslo se pohybuje v intervalu od 0 do 10.

source: LIST of keys
cs: Seznam klíčů

source: Flags
cs: Příznaky

source: Protocol
cs: Protokol

source: Algorithm
cs: Algoritmus

source: Public key code
cs: Kód veřejného klíče

source: LIST of filenames with dns keys
cs: Seznam jmen souborů s dns klíči

source: The EPP 'create_keyset' command is used to create a record of the KEYSET.
cs: EPP příkaz 'create_keyset' se používá pro vytvoření instance keysetu.

source: The EPP 'delete_contact' command is used to remove a record of the contact.
cs: EPP příkaz 'delete_contact' se používá pro smazání záznamu o kontaktu.

source: The EPP 'delete_domain' command is used to remove a record of the domain.
cs: EPP příkaz 'delete_domain' se používá pro smazání záznamu o doméně.

source: The EPP 'delete_nsset' command is used to remove a record of the nsset.
cs: EPP příkaz 'delete_nsset' se používá pro smazázní záznamu o NSSETu.

source: The EPP 'delete_keyset' command is used to remove a record of the keyset.
cs: EPP příkaz 'delete_keyset' se používá pro smazázní záznamu o KEYSETu.

source: Expiration date
cs: Datum expirace

source: Validation expires at
cs: Validace platná do

source: A domain names have a specified validity period. The server policy supports domain validity periods and the validity period is defined when a domain is created. This validity can be extended by the EPP 'renew_domain' command. Validity periods are measured in years or months with the appropriate units specified using the 'unit' attribute. Valid values for the 'unit' attribute are 'y' for years and 'm' for months. The minimum and maximum allowable period is defined in the Communication rules.
cs: Doménová jména mají definováno období platnosti. Pravidla serveru podporují v doméně nastavení období platnosti a tato hodnota je nastavena při vzniku domény. Lze ji prodloužit pomocí příkazu 'renew_domain'. Období platnosti se měří v rocích nebo měsících. Tento údaj se nastavuje pomocí hodnoty 'unit', kde 'y' znamená roky a 'm' měsíce. Minimálí a maximální hodnota období platnosti je definována v Pravidlech komunikace.

source: Change values
cs: Změna hodnot

source: Postal informations
cs: Poštovní informace

source: Address
cs: Adresa

source: data for with is set the flag value
cs: data, pro které se nastaví příznak

source: VAT
cs: DPH

source: The EPP 'update_contact' command is used to update values in the contact.
cs: EPP příkaz 'update_contact' se používá pro aktualizaci hodnot vybraného kontaktu.

source: Add administrative contact ID
cs: Přidat administrativní kontakt ID

source: Remove administrative contact ID
cs: Odebrat administrativní kontakt ID

source: Remove temporary contact ID
cs: Odebrat dočasný kontakt ID

source: The EPP 'update_domain' command is used to update values in the domain.
cs: EPP příkaz 'update_domain' se používá pro aktualizaci hodnot záznamu vybrané domény.

source: Add values
cs: Přidat hodnoty

source: List of DNS
cs: Seznam DNS

source: Technical contact ID
cs: Technický kontakt ID

source: Remove values
cs: Odebrat hodnoty
