Repository: CZ-NIC/fred-client
Catalog: fred/lang/fred_client_*.po
Languages: cs

source: This function creates command from values returned by command info_[contact|nsset|domain]. It is usefull if you want create new record with very similar values as some one saved on the server. Make these three steps: 1. Load values: info_contact CID:ID 2. Create command: fetch_from_info create 3. Modify command as you need and you can send it to the server. Valid command types what you can create by fetch_from_info are: create update delete The result is put directly into prompt if your terminal support this. When you want not result in your prompt join option 'noprompt' (or simply 'n') and result will be displayed on the output.
cs: Tato funkce vytvoří nový příkaz z hodnot vrácených příkazem info_[contact|nsset|domain]. To je užitečné, když chcete vytvořit nový záznam s velmi podobnými údaji, jaké jsou již uloženy na serveru. Proveďte tyto tři kroky: 1. Načtěte hodnoty: info_contact CID:ID 2. Vytvořte příkaz: fetch_from_info create 3. Upravte příkaz a můžete jej odeslat na server. Platné typy příkazů, které můžete pomocí fetch_from_info vytvořit jsou: create update delete Pokud to váš terminál podporuje je výsledek je vložen přímo do příkazové řádky. Nechcete-li jej mít v příkazové řádce připojte parametr 'noprompt' (nebo jen 'n') a výsledek bude zobrazen na výstupu.

source: No data
cs: Žádná data

source: Type '%s' for more information.
cs: Pro více informací zadejte '%s'.

source: Command to issue
cs: Příkaz k odeslání

source: No help available for
cs: Help nebyl nalezen pro

source: Type "help command" to get details of the chosen command.
cs: Zadejte "help command" pro zobrazení detailů vybraného příkazu.

source: Available session commands
cs: Dostupné session příkazy

source: Available EPP commands
cs: Dostupné EPP příkazy

source: Report bugs to
cs: Poruchy zasílejte na

source: Help for command
cs: Nápověda pro příkaz

source: DESCRIPTION
cs: POPIS

source: SYNTAX
cs: SYNTAXE

source: OPTIONS
cs: PARAMETRY

source: Type 'help' to list all available commands.
cs: Zadejte 'help' pro výpis dostupných příkazů.

source: Illegal use of interactive input mode.
cs: Neplatné použití interaktivního módu.

source: Type 'help !' to get more information about interactive input mode usage.
cs: Popis používání interaktivního módu se zobrazí zadáním příkazu 'help !'

source: Interactive input mode works with EPP commands only.
cs: Interaktivní mód zadání funguje pouze s EPP příkazy.

source: ERROR: Missing command to start interactive input
cs: CHYBA: Interaktivnímu vstupu nebyl zadán příkaz

source: Type 'help !' for more information.
cs: Pro více informací zadejte 'help !'.

source: Hidden commands are
cs: Skryté příkazy jsou

source: Load file
cs: Načíst soubor

source: Not found
cs: Nenalezen

source: Translation of answer column names is
cs: Překlad jmen sloupců odpovědi je

source: Command confirmation is
cs: Potvrzování odesílání příkazů je

source: null_value has been set to
cs: null_value bylo nastaveno na

source: null_value is
cs: null_value je

source: Client-side validation has been set to
cs: Validace na straně klienta byla nastavena na

source: Invalid Client-side validation parametr
cs: Neplatný parametr příkazu validate

source: Type 'help validate' to get more information about client-side validation.
cs: Zadejte 'help validate' pro výpis detailů o validaci.

source: Client-side validation is
cs: Validace na straně klienta je

source: You are connected already. Type disconnect for close connection.
cs: Již jste připojeni. Pro uzavření spojení zadejte disconnect.

source: You has been disconnected.
cs: Byli jste odpojeni.

source: Colors mode has been set to
cs: Barevný výstup byl nastaven na

source: Colors mode is
cs: Mód barevnosti je

source: Escaped input mode has been set to
cs: Mód escapovaného vstupu byl nastaven na

source: Escaped input mode is
cs: Mód escapovaného vstupu je

source: Verbose mode has been set to
cs: Mód výpisu byl nastaven na

source: Verbose mode is
cs: Mód rozsahu výpisu je

source: Unknown switch '%s'
cs: Neznámý přepínač '%s'

source: Type 'help poll_autoack' to get details on poll_autoack usage.
cs: Zadejte 'help poll_autoack' pro zobrazení použití příkazu.

source: Autoacknowledge poll has been set to
cs: Autopotvrzení poll bylo nastaveno na

source: poll_autoack is
cs: poll_autoack je

source: Output type has been set to
cs: Typ výstupu byl nastaven na

source: Output type is
cs: Typ výstupu je

source: Dir list
cs: Výpis adresáře

source: Interpreted answer
cs: Přeložená odpověď

source: Answer source
cs: Zdrojová odpověď

source: Interpreted command
cs: Přeložený příkaz

source: Command source
cs: Zdrojový příkaz

source: Unsupported language code: '%s'. Available codes are: %s.
cs: Nepodporovaná jazyková verze: '%s'. Dostupné verze jsou: %s.

source: Language is
cs: Jazyková verze je

source: User interface language is already
cs: Jazyková verze je již

source: User interface language has been set to
cs: Jazyková verze byla nastavena na

source: Reconnect to change server language too.
cs: Znove se připojte k serveru chcete-li změnit jazyk i na něm.

source: User interface language is
cs: Jazyková verze je

source: Missing command type. Available types
cs: Typ příkazu chybí. Platné typy jsou

source: Invalid command type. Valid types
cs: Neplatný typ příkazu. Platné typy jsou

source: At first you must receive values from info_[contact|nsset|domain].
cs: Nejdříve musíte získat hodnoty z info_[contact|nsset|domain].

source: Previous info_%s didn't return data.
cs: Předchozí info_%s nevrátilo žádné hodnoty.

source: You are logged already.
cs: Jste již zalogován

source: Login command sent to the server
cs: Příkaz login byl odeslán na server

source: File contains parsing errors.
cs: Při parsování souboru se vyskytly chyby.

source: See details in verbose 2 or higher.
cs: Detaily jsou zobrazeny ve verbose 2 nebo vyšším.

source: Element that caused a server error condition
cs: Element který způsobil chybu

source: Reason
cs: Důvod

source: Invalid response code
cs: Neplatný kód odpovědi

source: Missing result in the response message.
cs: V odpovědi chybí část result

source: Unknown server response
cs: Odpověď serveru nebyla rozpoznána

source: Unknown response type
cs: Neznámý typ části response

source: All data are disclosed.
cs: Všechna data jsou veřejná.

source: All data are hidden.
cs: Všechna data jsou skrytá.

source: Connected!
cs: Spojení navázáno!

source: Login failed.
cs: Login se nezdařil.

source: yes
cs: ano

source: no
cs: ne

source: Not in registry: Object is available.
cs: Není v registru: Objekt je dostupný.

source: Not available
cs: Nedostupný

source: Available
cs: Dostupný

source: The list is empty.
cs: Seznam je prázdný.

source: The list of the contacts is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam kontaktů je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the nssets is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam nssetů je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the keysets is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam keysetů je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the domains is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam domén je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the domains is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam domén je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the nssets is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam nssetů je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: The list of the keysets is ready on the server buffer and pointer is set at the beginning of the list. Call get_results command for gain data.
cs: Seznam keysetů je připraven v bufferu na serveru a ukazatel je nastaven na začátek seznamu. Pro získání dat zadejte příkaz get_results.

source: You are not logged. First type login.
cs: Nejste zalogováni. Nejdříve zadejte login.

source: You are not logged. You must call login() before working on the server.
cs: Nejste zalogováni. Nejdříve musíte zadat login().

source: Connection to %s interrupted.
cs: Spojení s %s bylo přerušeno.

source: Invalid port value: '%s'.
cs: Neplatné číslo portu: '%s'.

source: Port is out of range: %d.
cs: Port je mimo rozsah: %d.

source: Hostname missing
cs: Chybí hostname

source: Server port number missing
cs: Chybí číslo portu serveru

source: Username missing
cs: Chybí username

source: Password missing
cs: Chybí heslo

source: SSL certificate name missing
cs: Název SSL certifikátu chybí

source: SSL certificate file not found
cs: Soubor se SSL certifikátem nebyl nalezen

source: SSL private key name missing
cs: Název SSL privátního klíče chybí.

source: SSL private key file not found
cs: SSL privátní klíč nebyl nalezen

source: Can't connect to server
cs: Nemohu se připojit k serveru

source: Now I try again to connect with the zero timeout...
cs: Nyní se pokusím připojit znova s timeoutem nula...

source: Attempt at connection with the zero timeout has been successful.
cs: Pokus o připojení s nulovým timeoutem byl úspěšný.

source: Change timeout value to the zero in your configuration file.
cs: Nastavte si v konfiguračním souboru hodnotu timeoutu na nulu.

source: Attempt at connection again with the zero timeout, but this process failed.
cs: Pokus o znovupřipojení s nulovým timeoutem, ale proces selhal.

source: Server didn't return Greeting message. Contact server administrator.
cs: Server nevrátil Greeting odpověď. Kontaktujte správce serveru.

source: Ending session at
cs: Ukončení sezení na

source: Disconnected.
cs: Odpojeno.

source: Logout command sent to server
cs: Odeslán logout

source: updated
cs: aktualizováno

source: deleted
cs: smazáno

source: successfully transfered
cs: byla úspěšně transferována

source: request for send authorisation info transmited
cs: pořadavek na odeslání autorizačního hesla byl odeslán

source: The Request for technical test was successfully submitted.
cs: Požadavek na technický test byl úspěšně odeslán.

source: The message has been removed from the queue.
cs: Zpráva byla odebrána z fronty zpráv.

source: Return code
cs: Návratový kód

source: %s Usage: %s [OPTIONS...] Try '%s --help' for more information.
cs: %s Použití: %s [parametry...] Více informací získáze zadáním '%s --help'.

source: -d COMMAND, --command=COMMAND Send command to server and exit -o OUTPUT_TYPE, --output=OUTPUT_TYPE Display output as text (default), html, xml, php (Beware! For experimental only!)
cs: -d COMMAND, --command=COMMAND Pošli příkaz serveru a skonči -o OUTPUT_TYPE, --output=OUTPUT_TYPE Zobrazit výstup jako text (default), html, xml, php (Pozor! Jen pro testování!)

source: -q, --qt Run client in Qt4 GUI (Beware! For experimental only!)
cs: -q, --qt Spusť lkienta v Qt4 GUI (Pozor! Určeno jen pro testování!)
